driver-tests/httpsoapbc/dynamicURL/GETBP/src/test.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="test" targetNamespace="http://j2ee.netbeans.org/wsdl/GETBP/test"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/GETBP/test" xmlns:ns="http://xml.netbeans.org/schema/get" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/GETBP/test">
            <xsd:import namespace="http://xml.netbeans.org/schema/get" schemaLocation="get.xsd"/>
        </xsd:schema>
    </types>
    <message name="testOperationRequest">
        <part name="part1" type="xsd:string"/>
    </message>
    <message name="testOperationResponse">
        <part name="part1" element="ns:myntir"/>
    </message>
    <portType name="testPortType">
        <operation name="testOperation">
            <input name="input1" message="tns:testOperationRequest"/>
            <output name="output1" message="tns:testOperationResponse"/>
        </operation>
    </portType>
    <binding name="testBinding" type="tns:testPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="testOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/GETBP/test"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/GETBP/test"/>
            </output>
        </operation>
    </binding>
    <service name="testService">
        <port name="testPort" binding="tns:testBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/testService/testPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="test">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="testPortTypeRole" portType="tns:testPortType"/>
    </plnk:partnerLinkType>
</definitions>
