driver-tests/httpsoapbc/dynamicURL/GETCA/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:test="http://j2ee.netbeans.org/wsdl/GETBP/test">
  <soapenv:Body>
    <test:testOperation>
      <part1>289</part1>
    </test:testOperation>
  </soapenv:Body>
</soapenv:Envelope>